[{
"Ilce": "Akıncılar",
"Tarih": "1990",
"ResimURL": "https://raw.githubusercontent.com/iremergin/ilceler/main/akincilar.jpg",
"Nufus": "5.067",
"Aciklama": "Akıncılar ilçesinin içinde bulunduğu bölgenin tarihi Bakır Çağı'na kadar uzanmaktadır. M.Ö 547 yılında Persler'in idaresine geçen bölge M.Ö 331'de Makedon Krallığı tarafında ele geçirildi. 
Büyük İskender'in ölümüyle dağılan krallıktan sonra İskender'in generalleri tarafından yönetilen bölgede Pontus Krallığı hakim oldu. 
Pontuslular'ın M.Ö 66'da yenilgiye uğratılmasıyla bölgede Roma hakimiyeti başladı. 
Roma İmparatorluğu'nun resmi olarak ikiye bölünmesiyle bölge Bizans sınırları içerinde yer aldı.
Bölgeye Sasani ve sonrasında Arap orduları saldırsa da bölgedeki Bizans egemenliği devam etti. 
1058 yılında Selçuklu kuvvetleri tarafından ilk defa ele geçirilen bölge 1071'de gerçekleşen Malazgirt Meydan Muharebesi sonrasında kesin Türk iskanına sahne oldu. 
Bölge 11. yüzyıl sonlarında Danişmendliler Beyliği bölgeye hakim olmuş, 13. yüzyıl başlarında ise bölge Anadolu Selçuklu Devleti egemenliğine girmiştir.
Daha sonra sırasıyla bölge İlhanlılar, Eretna Beyliği ve Kadı Burhâneddin Devleti egemenliğindeki bölge 1398'de Osmanlı topraklarına katıldı. 
1402 Ankara Muharebesinde Timur İmparatorluğu' nun galip gelmesi ve akabinde Osmanlı'nın yaşadığı Fetret Devri neticesinde bölgede çıkan karışıklıkta 1421'de Akkoyunlular egemenliği sağladı.
Osmanlı-Akkoyunlu mücadelesinin uzun süre yaşandığı bölge 1473 Otlukbeli Muharebesi neticesinde kesin Osmanlı hakimiyetine girmiştir. 
Osmanlı'nın ilk döneminde Akşehirabad nahiyesine bağlıydı.
1645 yılında bölgeye gelen Evliya Çelebi yerleşimden Ermenilerler'in yaşadığı bağlık ve bahçelikli bir köy olarak bahsetmiştir.
Günümüz Akıncılar yerleşimi Osmanlı döneminde Ezbider-i Bâlâ (Yukarı Ezbider) ve Ezbider Zir (Aşağı Ezbider) olarak iki bölüme ayrılmıştı.
1860'larda Suşehri kazasının merkezi olmuş, ancak 1872'de çıkarılan Vilâyet Nizâmnâmesi uyarınca kaymakamlık yerleşimden kaldırılmıştır. 
1880 yılı salnamesinde Suşehri kazasının nahiyesi olarak kaydedilen yerleşimde, 2503 Ermeni ve 1978 Müslüman olmak üzere toplam 4481 kişi yaşamaktaydı.
1915'te Ermeniler'in başlattığı Şebinkarahisar isyanında Ezbider papazı Kerih'te yerleşimden bazı Ermenilerle birlikte Şebinkarahisar kalesinde isyana katıldı. 
Osmanlı bölgede denetimi sağlamak amacıyla yerleşimdeki Ermeniler problem oluşturamayacakları düşünülen bölgelere zorunlu göçe tabi tuttu. 
1932 yılında Sivas'a bağlanan yerleşim, 1958 yılında belediye oldu. 1962 yılında Ezdiber olan adı Akıncılar olarak değiştirildi. 
1990 yılında Suşehri'nden ayrılarak ilçe oldu."
},
 {
"Ilce": "Altınyayla",
"Tarih": "1990",
"ResimURL": "https://raw.githubusercontent.com/iremergin/ilceler/main/altinyayla.jpg",
"Nufus": "9.309",
"Aciklama": "Altınyayla İlçesi, 6 asır önce kurulduğu, eski adının Tonus ve Tonus kariyesi (köyü) olduğu Osmanlıca yazılı bulunan tapulardaki deyimlerden anlaşılmaktadır.
Eski adı Tonus olan Altınyayla, tarihinin ilk çağlarından bu güne kadar sırasıyla Anadolu’da medeniyetler kuran Hitit, Roma, Selçuklu ve Osmanlı gibi medeniyetlerinin yerleşim merkezlerinden biri oluşmuştur.
Osmanlı İmparatorluğu zamanında ve 1882 yıllarında Sivas vilayeti 4 sancak, 26 kaza 247 nahiyeden meydana gelmiş, bunlardan merkez sancağı Sivas olmak üzere, Pınarbaşı, Koçgirli, Zara, Divriği, Hafik, Gürün, Yıldızeli ve Tonus Sivas vilayetinin merkezi sancağı arasında yer aldığı bilinmektedir.
Bu dönemde Sivas beylerbeyliğine bağlı bir sancak olarak teşkilatlanan Tonus (Altınyayla) önemli bir konaklama yeri olmuştur.
Şarkışla İlçesine bağlı nahiye olarak faaliyetini sürdürmekte iken 1972 yılında yurt genelinde yapılan yerleşim birimleri isim değişikliği esnasında Tonus’un adı Altınyayla olarak değiştirilmiştir.
1972 Yılında Belediye teşkilatı kurulan Altınyayla 9 Mayıs 1990 tarih ve 3644 sayılı kanunla 20 Mayıs 1990 tarihinde İlçe statüsüne kavuşmuştur."
},
 {
"Ilce": "Divriği",
"Tarih": "1965",
"ResimURL": "https://raw.githubusercontent.com/iremergin/ilceler/main/divrigi.jpg",
"Nufus": "16.377",
"Aciklama": "Sivas İlinin Büyük İlçelerinden biri olan Divriği eski bir tarihe sahiptir. 
Hititler zamanından beri yerleşim alanı olarak bilinen Divriği’nin adı, eski Yunan yazmalarında Apbrike olarak geçmektedir.
Bizans devrinde Tepbrike olarak yaygın bir hal almış ve Türklerce Divrik adıyla anılmıştır.
Arap Coğrafyacıları ise şehrin adını ilk kaynaklara uygun olarak Abrik şeklinde tespit etmişlerdir.
Malazgirt Meydan Muharebesinden sonra Divriği Türk Egemenliğine girdiği, Divriği’nin Alpaslan’ın komutanı Mengücek Gazi’ye verildiği ve O’nun bağılı olduğu Oğuz boylarından Kayı, Bayat, Karaevli ve Akevli boylarının yerleştiği bilinmektedir.
Mengücek Gazi’nin oğlu İshak’ın 1142 yılında ölümü üzerine ikiye ayrılan Mengücek Beyliğinin Divriği kolunu Süleyman bey kurmuştur. Bu beylik kültürel bir gelişme gösterirken bir yandan‘da Anadolu Selçuklu Sultanlığına bağlı olarak Hıristiyanlara karşı sürmekte olan savaşlara katılmıştır. 
Bu devirde Süleyman Şah’ın 1224 tarihinde yaptırdığı KALE ile oğlu Ahmetşah tarafından 1228 yılında yaptırılan ULUCAMİ ve ayrıca Ulucamiye bitişik olarak Ahmetşah’ın karısı Turan Melek tarafından yaptırılan DARÜŞŞİFA büyük bir önem taşır.
Divriği’deki son Mengücek beyi Salih’e ait kitabe 1252 tarihini göstermektedir. 
Anadolu’daki türk birliğinin dağılmış olduğunu bu devirde, Sivas Eratna oğullarına bağlanmışken Divriği’nin Mısır-Memlük yönetiminde kaldığı görülür.
de Karyüllük Osman’ın Sivas Sultanı Kadı Burhanettin‘i Zara ile Divriği arasında yenilgiye uğratıp öldürmesinden sonra yöreye egemen olan Osmanlı Beyi Yıldırım Beyazıt, Divriği Kalesini Mısırlı Vali İbrahim Şuhri’nin Oğlundan teslim almış, ancak 1401’de Timur’a karşı Memlük İmparatorluğu ile bir anlaşma yaparken bu kaleyi yine onlara bırakmak zorunda kalmıştır. 
Divriği’nin Türk Beyliğine kesin olarak katılması, Yavuz Sultan Selim devrinde Mercidabık Zaferinin sonunda olmuştur. 
Osmanlı İmparatorluğunca Sivas Beyler Beyine bağlı bir Sancak olarak teşkilatlanan Divriği; Harput, Arapkir ve Zara yolu üzerinde önemli bir konaktı. 
17.yüzyıldan başlayarak Anadolu’da güvenliğin bozulması üzerine Tunceli dağlarına sığınan eşkiyaların baskısı altında kaldı. 
200 yıl süren bu güvensizlik devresinde şehir güvenilir sığınaklardan biriydi. Sivas İlinin yeniden teşkilatlanması üzerine Divriği bir İlçe haline getirilmiştir."
},
 {
"Ilce": "Doğanşar",
"Tarih": "1990",
"ResimURL": "https://raw.githubusercontent.com/iremergin/ilceler/main/dogansar.jpg",
"Nufus": "2.780",
"Aciklama": "Doğanşar'ın antik adı HYPSELE'dir.
Kelime İpsile şeklinde telaffuz edilerek günümüze kadar gelmiştir.
Doğanşar ve çevresinin Osmanlı dönemindeki ismiTOZANLI idi. 
Kaza merkezi İpsile olarak anılırken geneli kaynakların tamamında Tozanlı Kazası veya Tozanlı Nahiyesi şeklinde adlandırılmıştır. 
İpsile ve çevresi bu ismi, Tozan Bey ve aynı isimle anılan cemaatten almıştır. Tozan Bey, 1455 öncesinde yörede idarî ve askerî yetkilidir. 
Aynı nahiyedeki bir grup köyün hem malikâne hem de divanî gelirlerini elinde bulundurmaktaydı. Tozanlı cemaatinin lideri durumundaydı.
1940 tarihinde nahiye merkezine de Tozanlı adı verilmiştir. Ancak, bu ismin kullanılmadığı görülmektedir. 1960 tarihinde İpsile adı Doğanşar olarak değiştirildi. 
Doğanşar; yeni doğan şehir, memleket demektir."
},
{
"Ilce": "Gemerek",
"Tarih": "1965",
"ResimURL": "https://raw.githubusercontent.com/iremergin/ilceler/main/gemerek.jpg",
"Nufus": "24.828",
"Aciklama": "Hemen hemen tüm medeniyet ve uygarlıklar muhtelif zamanlarda Gemerek ve yöresine de hâkim olmuşlardır. 
Hâkim olan bu medeniyet ve uygarlıklar şunlardır: Paleolotik Dönem, Neolitik Dönem, Kalkolitik Dönem, Eski Tunç (Bronz) Dönemleri hakkında bazı bilgiler mevcut iken Hattiler, Hititler, Asur Ticaret Kolonileri, Frigyalılar, Kimmerler, Medler, Persler, Büyük İskender, Pontus Krallığı, Kapadokya Krallığı, Roma İmparatorluğu, Doğu Roma İmparatorluğu, Sasaniler, Emeviler, Haçlılar, Danişmendliler, Türkiye Selçukluları, İlhanlılar, Eratnalılar, Kadı Burhaneddin, Timurlular, Dulkadirliler [Oğuz-Türkmen telaffuzu ile Dulkadırlılar], Osmanlılar ve Türkiye Cumhuriyeti devletlerinin hâkimiyet alanı olmuştur.
XVI. yüzyılda biz Gemerek’i Bozok Sancağının Çubuk Nahiyesine bağlı bir karye yani köy olarak görmekteyiz. [Çubuk Nahiyesinin merkezi günümüzde Eskiçubuk ile Yeniçubuk’tur.
Yeniçubuk bu özelliğini hâlâ korumaktadır.] Ayrıca çeşitli dönemlerde Gemerek ve yöresinde Amerikan Board Örgütünün faaliyetleri bilinmektedir.
Gemerek, 1895-96 yılındaki Devlet Salnamesi ile Tonus ya da Tenos Kazası’nın (Şehr-i Kışla ya da Şarkışla’nın) müstakil bir nahiyesi olduğu bu tarihten sonra Osmanlıların son dönemine kadar adı geçen kazaya bağlı bir nahiye merkezi olarak nahiye müdürleri tarafından idare edilmeye başlandığı bilinmektedir. 30.11.1929 tarihinde Gemerek İstasyonu (günümüzdeki Yeniçubuk İstasyonu) açıldı.
1936 yılında ise Gemerek’te belediye teşkilatı kurulmuştu.
1950’li yıllardan sonra Ermeniler kendi istekleriyle İstanbul’a göç etmeye başlamışlar, bugün Gemerek’te hemen hemen hiç Ermeni vatandaşı kalmamıştır.
Farklı yerlere giden Ermeniler Gemerek kelimesini isim ve soyisim alarak veya yaşadıkları yere vererek Gemerek ile bağlarını koparmamışlardır. 
Şarkışla’ya bağlı Gemerek Bucağı, 1 Mayıs 1953 tarih ve 6058 sayılı kanun ile ilçe olmuştur"
},
{
"Ilce": "Gölova",
"Tarih": "1990",
"ResimURL": "https://raw.githubusercontent.com/iremergin/ilceler/main/golova.jpg",
"Nufus": "3.478",
"Aciklama": "Gölovanın tarihi M.Ö.2000 yıllarına kadar uzanmaktadır. 
İlçemizin kuzeyine düşen Söğütlü Göze mevkiinde Hitit Uygarlığından kalma bulgulara rastlanmıştır.
Bizans ve Trabzon-Rum Devletleri hakimiyeti altında kalan İlçe Fatih Sultan Mehmet’in 1461 yılında Trabzon-Rum Devletini fethetmesiyle Osmanlı İmparatorluğuna geçmiştir.
Eski adı Ağvanıs olan Gölova’dan Evliya Çelebi Seyahatnamesinde bahsetmektedir.
Gölova adını baraj yapılmadan önce Gölova önünde bulunan düz ova ve  kanlı göl ve çorak gölden almıştır. 
Kanlı göl adını ise gölün dibinde bulunan yosunların kırmızı renk olmasından almıştır.Çorak göl ise tuzlu olmasından almıştır.
Bu gölde eskiden ev hanımlarımız çamaşırlarını  yıkamaktadırlar.
1972 Yılında Belde statüsü kazanan Gölova 1990 yılında İlçe olmuştur."
},
{
"Ilce": "Gürün",
"Tarih": "1965",
"ResimURL": "https://raw.githubusercontent.com/iremergin/ilceler/main/gurun.jpg",
"Nufus": "19.076",
"Aciklama": "Eti Uygarlığının bölgede medeniyet kurduğu ve yaşadığı bilgisine mağaralardan elde edilen bilgilerle ulaşılmaktadır.
Hatta Şuğul Bölgesindeki kayalar üzerinden Etilere ait olduğu tahmin edilen yazılar bulunmuştur. 
Eski adı Tegerama olan Gürün zamanında bölgeyi koruyan en güçlü kalelerdendir.Anadolu’da İslami devletlerin hüküm sürmeye başlaması ile birlikte Gürün, Malatya Beyliği’ne ait bir kasaba oldu. 
Malatya Beyliği’nden sonra Danişmentliler, Kadı Burhaneddin ve Selçuklular’ın hakimiyetine girmiştir.
Yıldırım Beyazıt tarafından Osmanlı İmparatorluğu’na dahil edilmiştir. 1858’de ilçe olmuştur. "
},
{
"Ilce": "Hafik",
"Tarih": "1965",
"ResimURL": "https://raw.githubusercontent.com/iremergin/ilceler/main/Hafik.jpg",
"Nufus": "10.062",
"Aciklama": "İlçede ilk yerleşim Hafik Gölü'nün kuzey kıyısına yakın bir yerdeki Pılır Höyük'tedir.
Höyükte İlk Tunç Çağı ve Kalkolitik Dönem gereçleri veren katmanların ve gölün su düzeyinin altında üst katmanların çanak çömleğinden tümüyle farklı bir tür çanak çömlekle karşılaşılmıştır. Neolitik Dönem özellikleri gösteren bu buluntuların yanı sıra aynı döneme işaret eden başka buluntular da vardır. Çakmaktaşından minik uçlar, obsidyenden mini yaprak uçlar baskı çentikli olarak dişlikleri, el değirmeni taşları, tokmakları, kumtaşından yapılmış idoller ve hayvan kemikleri Pılır Höyük'te yapılan sondajda, yapı kalıntısı olarak da silindir biçimli çukurlar ve ağaç parçaları saptanmıştır.
Ağaç parçaları ve ahşap izleri, kazıklara aittir. Neolitik Dönem'den sonra da Pılır'da yerleşim devam etmiştir.
Ayrıca Beypınarı köyündeki Tekur Kalesi'nde toplanan seramiklerin incelenmesi sonucunda Helenistik-Roma Dönemi, Orta Çağ kaba seramiği ve boyalı seramik ve Erken Tunç Çağı perdahlı seramiklerden bu bölgenin Erken Tunç Çağı'nda yerleşim gördüğünü kanıtlamaktadır.
3000 yıllık yerleşimi olan Karlı Köyü, Boztepe Höyüğü'nde 1955 yılında Burney'in yüzey araştırmaları sonucunda MÖ 3000 ve Demir Çağı'na ait seramikler tespit edilmiştir.
Bununla birlikte MÖ 3000 nite, kaba, Orta ve orta nitelikli parçalar arasında kara özelliklerini gösterenlerin yanı sıra yerel nitelikli olanları da vardır.
Köylerinden bazılarında eski yıkık kiliseleri hâlen mevcuttur."
},
{
"Ilce": "İmranlı",
"Tarih": "1965",
"ResimURL": "https://raw.githubusercontent.com/iremergin/ilceler/main/imranli.jpg",
"Nufus": "7.412",
"Aciklama": "İmranlı ve çevresinin, tarihi süreç içerisinde Hitit, Pers, İskender, Roma ve Bizans imparatorluklarının hakimiyeti altında kaldığı bilinmektedir. 
Yine tarihi kaynaklarda bölgenin zaman zaman Müslüman Arapların eline geçtiği ve Malazgirt Savaşı sonrasında da Bizanslılar ile yapılan anlaşma gereğince Kızılırmak yayının dışında kalan yerlerin doğusu ile beraber bu bölgenin Türk idaresi altına girdiği kaydedilmektedir. 
İmranlı ve çevresinde 1075 yılında Danişmentliler, 1174 yılında Selçuklular, 1243 Kösedağ Savaşı'ndan sonra Moğollar 1340’lı yıllarda Eretna Beyliği, 1381-1398 yılları arasında Kadı Burhaneddin ve daha sonra da Osmanlılar hüküm sürmüştür.
Yıllardır farklı kültürlerin kardeşçe bir arada yaşadıkları bir bölge olan İmranlı ilçesinin ilk defa kimler tarafından ve ne zaman kurulduğu bilinmemekle beraber bölgenin canlılığı "93 Harbi" olarak bilinen 1876 Osmanlı-Rus Savaşı'yla artmıştır.
İmranlı geçmişinde çok yoğun bir orman dokusuna sahip olmasıyla bilinir. 
Bu sebepten devrinin önemli bir yerleşim yeri olan Zara’nın doğusunda kalan bu yörede dikkate değer bir yerleşim yeri bulunmamaktadır.
Batılı araştırmacı Sinclair 1372 yılında Zara’nın doğusundaki bugünkü İmranlı civarının aşırı derecede ormanlaşmış olduğunu ve belki de bu yüzden çok az sayıda seyyahın Zara’nın doğusunda şimdiki karayolu istikametinde seyahat ettiğini ileri sürmektedir.
İmranlı ve civarında önemli herhangi bir kentin olmaması ve bölgenin aşırı ormanlık olması gibi sebeplerden dolayı, 17. yüzyılda yaşamış olan Osmanlı seyyahı Evliya Çelebi dahi Sivas’tan Erzincan’a ve Erzurum’a Zara ve Suşehri üzerinden seyahat etmiştir. 
Bu tespit bazı Sivas Salnameleri (Yıllık) tarafından da desteklenmektedir. 
Hicri 1308 (1890 – 1891) tarihli Sivas Salnamesi’ne göre de Zara kazasının Abaş ve Çit nahiyelerinde görkemli bir orman bulunmaktadır."
},
{
"Ilce": "Kangal",
"Tarih": "1965",
"ResimURL": "https://raw.githubusercontent.com/iremergin/ilceler/main/kangal.jpg",
"Nufus": "21.669",
"Aciklama": "Eski devirlerdeki ismi Arangas ya da Aranga'dır. Kangal, ilk çağlardan beri yerleşimin varolduğu bir bölgedir. 
Karaseki'de, Akçakale Köyü'nde, “Hitit Şehri” kalıntıları ve iskânları tespit edilmiştir. İlk çağlara ait birçok bulgu, çeşitli müzelerde sergilenmektedir: Havuz Beldesi, Karaseki bölgesinde bulunan, Geç Hitit Dönemi'ne ait “Kapı Aslanı” heykeli Ankara Anadolu Medeniyetleri Müzesi'nde; Yarhisar Höyüğü'nde bulunan, yine Hitit Dönemi'ne ait, üzeri hiyeroglif yazılı altın mühür yüzük, Sivas Müzeler Müdürlüğü'nde sergilenmektedir.
Osmanlı döneminde kayıtlarda Yeni-il olarak geçmektedir. 
Yeni-il mali bakımdan padişah III. Murat'ın validesi Nur Banu Sultan'ın İstanbul Üsküdar'da yaptırdığı caminin evkafına bağlanmıştır. 
Bu nedenle de bu bölgeye yerleştirilen Türkmen gruplarına Yeni-il Türkmeni veya Üsküdar Türkmenleri denilmektedir.
1071 Malazgirt Savaşı'ndan sonra Türk hakimiyetine giren Kangal, Selçuklu Devleti ve Danişmend Devleti egemenliklerini görmüştür.
1413'te I. Bayezid devrinde Osmanlı hakimiyetine girmiştir.
Kangal, 1302 tarihli Sivas Salnamesi'nde “kaza” olarak geçer. 1902'de ilçe olmuştur; ilk kaymakam olarak eski Sivas valilerinden Ahmet Muammer Bey atanmıştır.
Millî Mücadele Dönemi'nde, bazı kaynaklarda geçen adı ile “Ulviye Kadın Cemiyeti”nin bir şubesi de Kangal'da açılmıştır.
 Sivas Kongresi sırasında çıkarılan, Millî Mücadele'nin ilk resmî yayını “İrâde-i Milliye Gazetesi”nde yayınlanan bir nizamnâme ile kurulan ve Anadolu'nun birçok kentinde faaliyet gösteren “Anadolu Kadınları Müdafa-i Vatan Cemiyetleri”nin ilk şubelerinden biri Kangal'da açılmış, Millî Mücadele'ye cephe gerisinde çok önemli hizmetlerde bulunmuştur."
},
{
"Ilce": "Koyulhisar",
"Tarih": "1927",
"ResimURL": "https://raw.githubusercontent.com/iremergin/ilceler/main/koyulhisar.jpg",
"Nufus": "12.637",
"Aciklama": "Koyulhisar'ın geçmişi İlk Çağ uygarlıklarına dayanmaktadır.
Dönemin en önemli ticaret merkezlerinden biri olan Kolonya, Koyulhisar'ın eski adıdır.
Erken Hristiyanlık döneminde adı Nicopolis (Anniaca) olup, bir manastır bulunurdu.
Bir keşiş olan Johannes Hesychastes 454'te burada doğdu.
Anadolu'nun Türkler tarafından fethinden sonra bu bölge de kısa süre içinde Türkleşmiştir.
Cücükgözoğulları, Oğuz-Türkmen boylarından Çepniler Horasan ve Kürtün yoluyla gelerek Koyulhisar ve civarına yerleşmiştir. 
Hacı Bektaş-ı Veli'nin ilk müritlerinden olan ve 1240 yılında çıkan İshak Baba İsyanı'na da katılan, Alevi inanç önderi Duman Baba burada yaşamış ve yaşamını yitirmiştir. 
Koyulhisar ilçesinde iki adet kayda değer hisar (kale) vardır ki Kale-i Bala adındaki hisarı Fatih Sultan Mehmed'in korkusundan Kızılbaş Akkoyunlu hükümdarı Uzun Hasan yaptırmış olup kale, Koyulhisar'ın eski merkezindedir.
Kale içlerinde altın kaplama bir hançer bulunmuştur.
Fatih, Karadeniz'in fethi sırasında, Koyulhisar bölgesine küçük bir birlik göndermiştir. 
Bu birlikteki asker sayısı çok azdıBirlik kaleye geldiğinde kaledeki asker sayısının kendilerinden 3 kat daha fazla olduğunu gördüler. 
Bunun üzerine bir akşam vakti Osmanlı birliği kalenin karşı tarafındaki koyun sürülerinin üzerilerine mum dikerler ve hücum için hazırlık yaparlar.
Kaledeki askerler karşılarına baktıklarında yüzlerce ışık görürler ve büyük bir ordunun kendilerine doğru gelmekte olduğunu sanırlar.
Herkes çok korkar ve komutanlarının emriyle tüm ordu ve halk kaleyi boşaltıp kaçmaya başlarlar. Bu sayede savaş yapılmadan Koyulhisar Osmanlı'ya bağlanmış olur.
Fethin ardından Fatih Koyulhisar'ın Yukarıkale köyüne bir cami yaptırır (1461). B
Bu camiye imam hatip olarak Mevlana Celaleddin-i Rumi'nin torunlarından birisini atar.
Bu hatip aynı zamanda bölgenin kadısı, valisi de sayılmıştır.
Osmanlı Devleti tarafından bu kişiye maaş bağlanmış, toprak verilmiş ve ev tahsis edilmiştir.
Caminin mali desteği Cumhuriyet dönemine kadar devlet tarafından karşılanıyordu.
Mütevellisi de atanan hatip idi. Dolayısıyla camiye "Hatipli (Hatipoğlu) Camii" adı verildi.
Bu zatın torunları hâlen Yukarıkale ve Hacıilyas köylerinde yaşamaktadırlar."
},
{
"Ilce": "Suşehri",
"Tarih": "1965",
"ResimURL": "https://raw.githubusercontent.com/iremergin/ilceler/main/sivas-susehri.jpg",
"Nufus": "25.392",
"Aciklama": "Eski bir yerleşim yeri olan Suşehri'nin tarihi Bakır Çağı'na kadar uzanmaktadır. 
Günümüzde Kılıçkaya Barajı suları altında kalan Kayadelen köyü yakınlarında yapılan arkeolojik kazılarda Bakır Çağı özelliklerini gösteren eşyalar bulunmuştur. 
Akşar, Eskişar, Kale köyleri ve Çataloluk beldesinde Roma, Bizans ve Büyük Selçuklu İmparatorluğu dönemlerinden kalma kale kalıntıları bulunmaktadır. 
İlçeye bağlı Büyükgüzel ve Küçükgüzel köylerinin eski yerleşim yerlerinin, bulunan tarihi kalıntılar ile Roma İmparatorluğu döneminde önemli birer merkez olduğu tespit edildi. 
Küçükgüzel köyündeki arkeolojik çalışmalar ile gün yüzüne çıkarılan aslan başı mermeri ile önemli bir yapıya ait olduğu düşünülen bazı kalıntılar Sivas Müzesi ve Suşehri Hükûmet Konağı bahçesinde sergilenmektedir.
Suşehri'ne bağlı köylerden Akşar köyünün Orta Çağ'da önemli bir merkez olduğu, Suşehri ve civarındaki yerleşim yerlerinin idari açıdan buraya bağlı olduğu belirlenmiştir.
Günümüzdeki adı Suşehri ovası olan düzlüğün Akşar ovası olarak adlandırıldığı ve Selçuklular zamanında Aq-Šahr veya başka bir ifadeyle Aqšer-abād adı altında önemli bir ulaşım noktası olduğu rivayet edilmiştir.
1875 yılında yeniden yapılan vilayet düzenlemesinde Şebinkarahisar sancağı Trabzon Vilayeti'nden alınarak Amasya ve Tokat ile birlikte Sivas Vilayetine bağlanmıştır.
Bu düzenleme ile Suşar (Gölova) ve Akşar Subaşılıkları kaldırılmış ve Endires köyüne ilçe teşkilatı kurularak "Şehr-i Su" adı verilmiştir.
20 Mayıs 1933'te çıkarılan bir kanunla Suşehri'nin bağlı bulunduğu Şebinkarahisar ilçe yapılarak Merkez kazası ile Alucra kazası Giresun'a bağlanınca Suşehri ve Koyulhisar Sivas iline; Mesudiye de Ordu'ya bağlanmıştır."
},
{
"Ilce": "Şarkışla",
"Tarih": "1965",
"ResimURL": "https://raw.githubusercontent.com/iremergin/ilceler/main/Sarkisla.png",
"Nufus": "38.314",
"Aciklama": "Şarkışla ilçesinin milattan önce 3000 yıllarından itibaren bir yerleşim merkezi olduğu bilinmektedir. 
İlçe merkezine 5 km uzaklıktaki Döllük köyünün ilçe sınırlarına yakın bir yöresinde 1940 yılında bulunan, MÖ 2000 yıllarına ait olduğu kabul edilen heykelin varlığı bu tarihi doğrulamaktadır. 
Heykel tunçtan yapılmış olup 12 cm boyundadır. Hâlen Ankara Arkeoloji ve Etnografya Müzesinde muhafaza edilmektedir. Ayrıca yine Şarkışla yöresinden elde edilen "Hitit Tören Baltası" önemli bir tarihî eser olarak literatüre geçmiştir.
Bronzdan yapılmış olan[6] eser MÖ 1400-1100 arasına tarihlenmektedir.
Sırasıyla Hattilerin, Hititlerin, Etilerin, Perslerin ve Roma krallığının yönetiminde kalmıştır.
MÖ 700’den itibaren Kafkasya üzerinden gelen Kimmerler bu yöreyi (ayrıca Kapadokya bölgesini) yağmalamışlar ve tahrip etmişlerdir. 
Daha sonra İskit saldırılarına da uğrayan yöre bunun ardından Medler tarafından ele geçirilmiştir.
Med Devleti’ni yıkan Persler ise Sivas ve çevresini Kapadokya Satraplığı’na bağlamışlar.
Persleri yenen Büyük İskender ile birlikte Makedonların egemenliği başlamıştır.
Şarkışla 11. yüzyıl başlarında Danişmendlerin, 12. yüzyılın 2. yarısında Anadolu Selçukluları’nın eline geçmiştir."

},
{
"Ilce": "Ulaş",
"Tarih": "1990",
"ResimURL": "https://raw.githubusercontent.com/iremergin/ilceler/main/ulas.jpg",
"Nufus": "9.682",
"Aciklama": "Ulaş ilçesinin ilk olarak iskanı Selçuklular dönemine dayanmaktadır.
Ulaş ilçesi doğu transit yolu üzerindedir. Selçuklular döneminde, ilçe girişine yaptırılmış bulunan Selçuk Hanı kalıntıları ilçenin önemli bir ticaret merkezi olduğunu kanıtlamaktadır.
Osmanlı devletinin kuruluş yıllarının başlangıcında Osmanlılara bağlanan bu yerleşim merkezi, o dönemde de önemini sürdürmüş ve Bağdat yolu ile batı ve doğuya bağlantısını kurmuştur.
Önemli bir yerleşim merkezi olan Ulaş İlçesi, Cumhuriyet döneminde doğudan gelen göçmenler ile Bulgaristan ve Yugoslavya’dan gelen göçmenlerin iskanı ile nüfus yoğunluğunu artırmıştır. 
Bu dönemde yapılan doğu transit yolu da Ulaş ilçesinden geçmektedir. 1968 yılında Belediye teşkilatı kurulmuş, 20 Mayıs 1990 tarihinde de ilçe teşkilatı kurulmuştur."
},
{
"Ilce": "Yıldızeli",
"Tarih": "1965",
"ResimURL": "https://raw.githubusercontent.com/iremergin/ilceler/main/Yildizeli.jpg",
"Nufus": "31.748",
"Aciklama": "Sivas ve çevresi ile ilgili yazılan kitaplarda, hazırlanan yıllıklarda Yıldızeli tarihçesinin başlangıcı olarak 1639 yılı alınsa da, ilçede tarih öncesinde M.Ö.4500’lerden itibaren yerleşimlerin olduğu, yapılacak yeni arkeolojik çalışmalarla bu tarihin çok daha öncelerine inebileceği anlaşılmıştır.
İlçenin Kalkolitik Devir’den itibaren, Eski Tunç, Orta Tunç, Hitit, Frig, Med ve Pers dönemleri, Makedonya Krallığı ve Hellenistik dönem, Roma, Bizans, Selçuklu, Beylikler ve Osmanlı döneminden günümüze kadar uzanan bir tarih sürecinde Orta ve Doğu Anadolu’nun bir geçiş bölgesi olarak sürekli iskana tabi olduğu anlaşılmaktadır.
Yeterli araştırma olmaması sebebiyle Yıldızeli civarında antik ismi bilinen yerleşim yoktur.
Bugünkü ilçe merkezinin bilinen ilk adı “YENİHAN”dır. 
Bu isim yöreye l639 yılında ilçenin yerleşim yeri olarak kurulduğu sırada yaptırılan handan dolayı verilmiştir.
 Osmanlılar döneminde ve Cumhuriyetin ilk yıllarında da aynı şekilde kullanılmıştır.
1936 yılında, ilçe sınırları içerisinde bulunan ve bölgenin en yüksek dağı olan Yıldız Dağı’ndan ( 2557) esinlenerek “Yenihan” adı “YILDIZELİ” olarak değiştirilmiştir."
},
{
"Ilce": "Zara",
"Tarih": "1965",
"ResimURL": "https://raw.githubusercontent.com/iremergin/ilceler/main/zara.jpg",
"Nufus": "21.753",
"Aciklama": "Anadolu Selçuklularının Moğollar tarafından yıkılmasını kesinleştiren Kösedağ Savaşı Zara'da olmuştur (1243).
Moğol hakimiyetinden sonra Zara, Eretna ve Türkmen Kadı Burhanettin devletlerinin idaresinde kalmıştır.
Yapılan son araştırmalara göre ilçe ve çevresine ilk olarak Neolitik Dönemi'nde yerleşildiği sanılmaktadır. 
Zara-Hafik arasındaki höyükte yapılan kazıda Neolitik Dönemi özellikleri gösteren çakmak taşından minik uçlar, el değirmeni taşları ve hayvan kemikleri gibi buluntular çıkmıştır."
}
]